WELCOME_TITLE = (
    "Привет! Бот ZAP уже на связи!"
)

HELLO = "Привет, я помощник ZapTeam. Наша задача — провести твой платёж за границу легко, безопасно и быстро. Выбери то что подходит тебе!"

FAQ_INTRO = "Частые вопросы (FAQ). Выбери вопрос:"
FAQ_Q_AGENT = "Платежный агент — кто он?"
FAQ_A_AGENT = (
    "Это компания, которая оказывает услуги по проведению международных платежей для организаций, "
    "участвующих во ВЭД. Выступает посредником между импортёрами/экспортёрами и иностранными поставщиками/покупателями, "
    "обеспечивая проведение платежей в условиях ограничений и санкций."
)
FAQ_Q_SANCTIONS = "Как вы действуете во время санкций и в рамках законодательства РФ?"
FAQ_A_SANCTIONS = (
    "Являясь прямым партнёром с одной стороны банка и с другой стороны партнёром платёжного агента, мы выступаем в качестве брокера который помогает осуществить платежи для вашего бизнеса. "
    "Это является законным в Российской Федерации."
)
FAQ_Q_GUARANTEES = "Какие гарантии вы предоставляете?"
FAQ_A_GUARANTEES = (
    "Предоставляем 100% гарантию переводов. Все документы хранятся на платформе в личном кабинете, можно вернуться к ним в любой момент."
)
FAQ_Q_DOCS = "Какие документы нужны перед созданием платежа?"
FAQ_A_DOCS = (
    "Все документы с агентом подписываются онлайн.\n\n"
    "Контракт с поставщиком/ покупателем.\n"
    "Инвойс - основной документ, содержащий информацию о сделке, сумме, валюте и реквизитах для оплаты.\n"
    "Договор с платёжным агентом.\n"
    "Контракт должен стоять на валютном контроле в вашем банке."
)

USDT_INFO = (
    "Все операции с USDT покупка, обмен, оплата мы выполняем быстро и в срок, у нас лучшие курсы и минимальные комиссии!\n\n"
    "Документы, договор, безопасность — всё на нас. Ты — платишь. ZAP — решает."
)

ROLE_CHOOSE = "Чем ты занимаешься?"
ROLE_INDIVIDUAL_TEXT = (
    "Супер! Мы работаем с физ лицами в любых объёмах и закрываем любые цели и вопросы. Оплата машины, жилья, учебы и других нужд. А так же работаем с USDT!"
)
ROLE_BUSINESS_ASK = "Здорово! Теперь давай выясним, есть ли у тебя контракт с поставщиком и стоит ли он на валютном контроле?"
ROLE_NONRESIDENT_ASK_INVOICE = "Есть ли у тебя инвойс или расчёт от получателя?"

STEPS_CORE = (
    "Супер! Осталось всего 2 ШАГА!\n\n"
    "1. Пройди регистрацию на платформе официального платёжного агента CORE\n"
    "2. Соверши платёж — контроль и исполнение в течение 24 часов\n"
    "Комиссия — от 0.5%, документы готовим вместе.\n\n"
    "Ты — платишь. ZAP — решает."
)

CORE_ABOUT = (
    "Платформа CORE является лидирующей финтех компанией в сфере ВЭД платежей, оплате инвойсов и других международных фин операциях. Мы работаем с ними с самого открытия."
)

CONTACT_REDIRECT = (
    "Окей. Агенты ZAP уже ждут тебя в чате. Там ты сможешь пообщаться, получить ответы на свои вопросы. Опиши свою задачу в чате и мы найдём решение. Вот ссылка на чат"
)


